import './SectionContainer.css';

function SectionContainer() {
    return(
        <>
            <section>
                <div className="container section-container">
                    <article>
                        <h3><span>Порада –</span> від Yummy</h3>
                        <p>
                            З'ївши чергову шоколадку, ви не просто набираєте трохи додаткових калорій, але покращуєте тим
                            самим роботу мозку, настрій і стаєте трішки добрішим. Вирішивши поласувати шоколадкою,
                            віддавайте перевагу саме чорному шоколаду з високим вмістом какао-бобів. У цьому вигляді
                            шоколаду менше жиру і цукру, ніж в молочному шоколаді, але зате магнію, кальцію, заліза, білка,
                            антиоксидантів і вітамінів предостатньо.
                        </p>
                        <h5>Солодощі, які радить їсти Ямі:</h5>
                        <ul>
                            <li>Чорний шоколад</li>
                            <li>Зефір</li>
                            <li>Пастила</li>
                            <li>Мармелад</li>
                            <li>Мед</li>
                            <li>Халва</li>
                            <li>Цукати</li>
                        </ul>
                    </article>
                </div>
            </section>
        </>
    )
}

export default SectionContainer;