[
    {
        "title": "Вступ до JSX",
        "body": "Він має назву JSX, і це розширення синтаксису для JavaScript. Ми рекомендуємо використовувати його в React, щоб описати, як повинен виглядати інтерфейс користувача. JSX може нагадувати мову шаблонів, але з усіма перевагами JavaScript.",
        "href": "https://uk.legacy.reactjs.org/docs/introducing-jsx.html"
    },
    {
        "title": "Компоненти і пропси",
        "body": "Концептуально компоненти є подібними до функцій JavaScript. Вони приймають довільні вхідні дані (так звані “пропси”) і повертають React-елементи, що описують те, що повинно з’явитися на екрані.",
        "href": "https://uk.legacy.reactjs.org/docs/components-and-props.html"
    },
    {
        "title": "Стан та життєвий цикл",
        "body": "У додатках React, наявність або відсутність стану в компонента вважається деталлю реалізації компонента, і може змінюватися з часом. Можна використовувати компоненти без стану всередині компонентів зі станом та навпаки.",
        "href": "https://uk.legacy.reactjs.org/docs/state-and-lifecycle.html"
    },
    {
        "title": "React без JSX",
        "body": "JSX не є вимогою для роботи з React. Використання React без JSX є найзручнішим тоді, коли ви не бажаєте налаштовувати компіляцію у вашому середовищі збірки.", 
        "href": "https://uk.legacy.reactjs.org/docs/react-without-jsx.html"
    },   
    {
        "title": "Обробка подій",
        "body": "Обробка подій для React-елементів дуже схожа до обробки подій для DOM-елементів. Але є деякі синтаксичні відмінності Події React іменуються в camelCase, а не в нижньому регістрі.JSX ви передаєте функцію як обробник події замість рядка.", 
        "href": "https://uk.legacy.reactjs.org/docs/handling-events.html"
    },   
    {
        "title": "Форми",
        "body": "У React HTML-елементи форм працюють дещо інакше, ніж інші DOM-елементи, тому що елементи форм від початку мають певний внутрішній стан. Наприклад, в цю HTML-форму можна ввести ім’я", 
        "href": "https://uk.legacy.reactjs.org/docs/forms.html"
    }   
]